{"intents":
  [
    {
      "tag":"greeting",
      "input":["hello","hi there","greetings","nice to meet you","heyoo","sasa?","hi","hey there","hey","hi there","niaje","hello there","anyone there ?","hello bot"],
      "responses":[
          "Hi. Welcome to CPIMS?, how can I assist you today ?",
          "Hi there! How can I assist you with the CPIMS system today?","Nice to meet you! How can I be of service regarding the CPIMS system?","Hey there! How can I help you with the CPIMS system?","Hello! How can I be of assistance with the CPIMS system?","Sasa! How may I assist you with the CPIMS system?","Hello! How can I be of assistance with the CPIMS system?","Hey there! How can I help you with the CPIMS system today?","Hi there! How may I assist you regarding the CPIMS system?","Niaje! How can I be of service regarding the CPIMS system?","Hello there! How can I assist you with the CPIMS system?","Hello! I'm an AI-based virtual assistant for the CPIMS system. How can I help you?","Knock knock. Who's there? It's the AI-based virtual assistant for the CPIMS system. How can I assist you?",
          "Hi, what how can I be of help ?","Hello! I'm an AI-based virtual assistant for the CPIMS system. How may I assist you today?",
          "Hello! I am an AI-based virtual assistant designed to assist you with any queries or issues related to the CPIMS system. How can I assist you today?"
        ]
    },
    {
"tag":"discharged",
      "input":["Not able to follow-up discharged kids","discharged","discharge","Can I understand why on dashboard I have 5 children who are indicated as discharged yet they are still with us"],
      "responses":[
          "Sometimes there is a delay in the status upgrade but we will check it up","For a case to 'disappear from pending' as you put it,you must have provided at least one service by managing encounters.If you don't manage any encounter but you manage a service,referral or court session,it still remains pending. So,there is a great chance that in some cases you have not managed an encounter hence them remaining as pending."
               
   ]
    }, 
    {
"tag":"cases",
      "input":["why is date of next mention inactive for future dates inactive in the management for court sessions"],
      "responses":[
          "It's not possible to confirm all cases esp far court, orderlies/ police escort are frequently changed you can't keep track. A workable solution would be in order"
   ]
    },
    {
"tag":"slownet",
      "input":["CPIMS seems to be very slow today Kuna issue","I am unable to register new child data. It's hanging. Your assistance please."],
      "responses":[
          "From the system side there is no problem and could be a network issue.","Kindly Check your internet, CPIMS is working","Kindly restart your machine","Try refreshing your browser","kindly log out and try logging in again"
   ]
    },
{
"tag":"installation",
      "input":["Kindly assist me to have CPIMS on my lap top. Please advice.","install","installation","how can i put CPIMS", "How can i install CPIMS in my computer", "How will i install CPIMS"],
      "responses":[
          "Type the url: childprotection.go.ke on your browser and log in with your credentials"
   ]
    },
    {
"tag":"accountlocked",
      "input":["my account has been locked.","Am not able to access my account.","Hi am not able to access my cpmis account","having trouble to log into the system since eight in the morning. Help!","Please my account is locked I need assistance","Kindly assist to unlock the account.","It seems today I'm not able to access CPIMS. Any help"
],
      "responses":[
           "Use the forgot password functionality to reset.","Step 1: Go to reset password link from login page or directly from here https://childprotection.go.ke/accounts/password/reset/\n  Step 2: Enter you email address and a link will be sent to the email\n  Step 3: Click on the link in the email to reset password\n  Step 4: Enter new password and repeat it and click submit (This will NEVER ask you for your old password and if it does then it means you are already logged in to CPIMS)\n  Step 5: Log in with your new password in Step 4 and if it requests after log in to change password then your old password will be the one in Step 4.",
          "Please try logging in from another machine and report if it works. You can even use your phone. www.childprotection.go.ke is up and running. Please confirm that your internet connection is active and try to logging in from another computer.","use the forgot password functionality",
          "Hello kindly clear history n caches of your browser or you can use another recommended browser"
        ]
    },
    {
"tag":"duplicate",
      "input":["I have this duplicates please assist","duplicate","For double registration do we delete or discharge","double entry","undo double entry","How do I undo double entry","Good afternoon what causes duplication of persons when placing in the institution?"],
      "responses":[
          "You need to delete one in the persons registry.","This will be corrected from placement dashboard as it is caused by the fact the child had multiple case categories.","You will have to give me the CPIMS ids of each duplicated pair and tell me the one to delete.",
          "If in registry just delete but if in placement forward the CPIMS ids. Working on a permanent solution about it.",
          "Please try logging in from another machine and report if it works. You can even use your phone. https://www.childprotection.go.ke is up and running. Please confirm that your internet connection is active and try to logging in from another computer."
        ]
    },
    {
      "tag":"resetpassword",
      "input":["Forgot password kindly assist","password","reset","reset my password","Kindly reset","May you reset","Kindly someone reset","Good morning, I am trying to reset my password in the CPIMS but the system is saying error processing your request contact admin","I am trying to reset my password","Kindly assist in password rest","Kindly reset my account","I have not been able to have my password reset","Am trying to set password in vain. Kindly assist","Kindly reset account.","Can I use my email for password reset","Please reset","It seems as if have forgotten my old pass word","Hello,I forgot my old password and the system is requesting me to change my password. please help"],
      "responses":[
          "kindly use the password reset functionality. however if you have not used the system for over three months and you can remember the email used when creating the account, contact the supervisors or the admin","The CPIMS reset password reset link is located on the login page just after the submit button or you can click on this link: https://childprotection.go.ke/accounts/password/reset/",
          "Use the forgot password functionality to reset.","use the forgot password functionality",
          "Kindly use forgot password functionality to reset your password","The CPIMS reset password reset link is located on the login page just after the submit button or you can click on this link: https://childprotection.go.ke/accounts/password/reset/",
          "reset using forgot password functionality","Step 1: Go to reset password link from login page or directly from here https://childprotection.go.ke/accounts/password/reset/\n  Step 2: Enter you email address and a link will be sent to the email\n  Step 3: Click on the link in the email to reset password\n  Step 4: Enter new password and repeat it and click submit (This will NEVER ask you for your old password and if it does then it means you are already logged in to CPIMS)\n  Step 5: Log in with your new password in Step 4 and if it requests after log in to change password then your old password will be the one in Step 4.",
          "Use the forgot password functionality."        
]
    },
    {
      "tag":"howami",
      "input":["how are you ?","I am fine , how are you ?","are you fine ?","how are things going on ?","everything going on okay ?","how's everything there ?","how's everything going on ?","is everything okay ?"],
      "responses":[
          "As an AI-based virtual assistant, I don't have emotions or feelings like humans do. However, I am here to assist you with any CPIMS-related queries or issues that you may be facing. So if you have any questions or concerns about the CPIMS system, feel free to ask and I'll do my best to help you.",
          "As an AI-based virtual assistant, I don't have feelings or emotions like humans do. However, I'm functioning as intended and ready to assist you with any questions or issues related to the CPIMS system. \n Is there anything specific related to CPIMS that you need help with?",
          "Since I am an AI-based virtual assistant, I don't have feelings like humans do. However, I am always functioning well and ready to assist you with any queries or issues you may have related to the CPIMS system. \n How may I assist you today?",
          "As an AI-based virtual assistant, I don't have feelings or emotions like humans do. However, I am here and ready to assist you with any queries or issues you may have regarding the CPIMS system.\n  Please let me know how I can be of assistance"
        ]
    },
    {
      "tag":"whoareyou",
    "input":["who are you ?","what are you ?","what is your name ?","are you a chatbot ?","what can I call you ?","your name ?","are you a bot ?","how do I address you ?","How do I call you"],
      "responses":[
          "I am a virtual assistant designed to provide user support for the CPIMS system. You can call me by my default name, Maya",
          " I am a chatbot powered by artificial intelligence technology",
          "You can address me by Maya or simply refer to me as the virtual assistant for CPIMS.",
          " I am an AI-based virtual assistant designed to provide user support.",
          "I am a chatbot or virtual assistant powered by AI. You can address me by saying 'Hey Maya' or simply 'Maya' if you want to ask me anything related to the CPIMS system or need assistance with any CPIMS-related task.",
          "I am a language model created by OrielAI and trained to assist with various tasks. "
        ]
    },
    {
      "tag":"whereareyou",
    "input":["where are you from ?","which country are you from ?","where do you live ?","where are you ?","where do you live in ?","which place do you live in ?","where are you currently at","where do you live currently ?","you are from where","you are from ?"],
      "responses":[
          "As an AI-based virtual assistant, I don't have a physical location, and I don't live in a particular country or place. I exist solely as a program running on computer servers maintained by OpenAI.However, I was created to provide user support for the CPIMS system developed by OrielAI at Kabarak University, Kenya. So, while I am not physically located in Kenya, my purpose is to assist users who are using the CPIMS system developed by OrielAI at Kabarak University.",
          "I am an AI-based virtual assistant designed to provide user support for the CPIMS system. I was created by OrielAI at Kabarak University in Kenya. However, as an AI-based virtual assistant, I do not physically exist in a specific location. I exist only in the digital realm and am accessible from anywhere with an internet connection.",
          "As an AI-based virtual assistant, I do not have a physical location or country of origin. I was created by OpenAI and trained to assist with tasks related to the CPIMS system by OrielAI at Kabarak University in Kenya. While the team that created and trained me is located in Kenya, I exist entirely in the digital realm and can be accessed from anywhere in the world with an internet connection.",
          "As an AI-based virtual assistant,I don't have a physical location or a place of origin.I exist solely in the digital world and operate through servers and computer systems. However, I was created by OrielAI, which is a technology company based in Kabarak University, Kenya. Specifically, I was designed to provide user support for the CPIMS system, which is used in various organizations around the world to manage child protection information.So while I don't have a physical location, my creation is linked to Kabarak University, which is located in Kenya."
        ]
    },
    {
      "tag":"crash",
      "input":["What should I do if I'm unable to access the CPIMS system due to a computer crash?","Are there any warning signs that my computer might be about to crash, and how can I recognize them?","Can you provide any troubleshooting tips for fixing a computer that has crashed","What should I do if my computer crashes while I'm using the CPIMS system"],
      "responses":[
        "if your computer has crashed and you need technical assistance, I recommend reaching out to your organization's IT support team or contacting a professional computer repair service. They should be able to assist you with resolving the issue and getting your computer back up and running.","Contact the IT team for assistance",
        "If your computer crashes while using the CPIMS system, try restarting your computer and reopening the CPIMS system. If the issue persists, contact the organization's IT support team for further assistance.",
        "To prevent your computer from crashing while using the CPIMS system, make sure that your computer meets the system requirements for the software and keep your computer's operating system and antivirus software up-to-date. Additionally, avoid running too many programs or tasks simultaneously as this can strain your computer's resources","If your computer has crashed, try restarting it and running a virus scan to check for any malware or viruses that may be causing the issue. If the issue persists, contact your organization's IT support team for further assistance.","Depending on the cause of the computer crash, you may or may not lose data or information stored in the CPIMS system. It is always a good idea to regularly backup your data to prevent data loss in the event of a computer crash"
      ]
    },
    {
      "tag":"transfer",
      "input":["transfer a child to a different institution","transfer","Hi,I need advice from team leaders here, when you discharge child from institution should it automatically reduce in pending cases on dashboard?","What I mean is when I discharge some children from institution some disappear from pending cases on dashboard while others remain despite showing successfully discharged from institution, what could be reason? please experts advice","What would be the problem the children am placing do not appear at the dashboard"],
      "responses":["1. Institution population appears on the dashboard (Boys/Girls) \n 2. To Search for a child just use the search bar appearing on all pages at the top put child name and click enter. \n  3. In child search results there is a history button to give child past CPIMS interactions (past cases, institution placements and any program enrollments like USAID OVC program, PSSB)\n 4. In case record detail and institution details (Edit, Print, pdf) has been added. The print button is now functional. \n 5. when your password is changed you will recieve a CPIMS internal notification.\n  6. When you transfer a child to another insitituion the users in the other SI will be notified.\n \n TO DO \n1. All notification are CPIMS internal and we are working on email and SMS if possible.\n 2. To work on your feedback",
        "For a case to 'disappear from pending' as you put it,you must have provided at least one service by managing encounters.If you don't manage any encounter but you manage a service,referral or court session,it still remains pending. So,there is a great chance that in some cases you have not managed an encounter hence them remaining as pending.","\nStep 1. Institution population appears on the dashboard (Boys/Girls) \n 2. To Search for a child just use the search bar appearing on all pages at the top put child name and click enter.\n 3.In child search results there is a history button to give child past CPIMS interactions (past cases, institution placements and any program enrollments like USAID OVC program, PSSB)\n 4. In case record detail and institution details (Edit, Print, pdf) has been added. The print button is now functional.\n 5. when your password is changed you will recieve a CPIMS internal notification.\n 6. When you transfer a child to another insitituion the users in the other SI will be notified.\n \n TO DO\n \n 1. Currently all notification are CPIMS internal and we are working on email and SMS if possible.\n 2. To work on your feedback\n\","
        ,"For a case to 'disappear from pending' as you put it,you must have provided at least one service by managing encounters.If you don't manage any encounter but you manage a service,referral or court session,it still remains pending. So,there is a great chance that in some cases you have not managed an encounter hence them remaining as pending.","Logout and login again it should be okay"
      ]
    },
    {
      "tag":"livesystem",
      "input":["Hi transfer children to Reception on live system","live system","livesystem","Hi transfer children to Reception on live system","Transfer to live system rehabilitation school.",
"Hi, the following children have been placed in active please kindly assist to enable us to transfer them in our Institution","Mtu anaingia vipi Kwa live system","Hello can I get assistance in the opening of the live system it's much time and there is no immediate response please let know how to go about it","Hello can I get the technicians to go about activating my live system","How do I get to the live System","what are the basic skills to get recruited ?"],
      "responses":[
        "Go to follow, write name of child followed by no cco---then click institutional place, it will give type admission, then click transfer in.",
        "Once you hit the target of the tests. We will register you on live.","SCCO Please communicate the accounts you have created on live CPIMS for the respective CCIs as most of the queries here are because they have not been created yet but the users are trying to log in to the system.","Kindly access the link using https://childprotection.go.ke/login/?next=/","Please contact your SCCO for the details. Most of these accounts have not been created yet."
      ]
    }
  ]
}
